backend/test/Anela.Heblo.Adapters.Shoptet.Tests/IssuedInvoices/Fixtures/invoice-126000039.json

{"data":{"invoice":{"code":"126000039","orderCode":"126000039","creationTime":"2026-04-27T09:15:52+0200","changeTime":"2026-04-27T09:15:52+0200","dueDate":"2026-05-04","taxDate":"2026-04-27","addressesEqual":true,"documentRemark":null,"varSymbol":126000039,"constSymbol":null,"specSymbol":null,"isValid":true,"billingMethod":{"id":4,"name":"Kartou"},"vatPayer":true,"items":[{"code":"TON002030","name":"REDACTED","variantName":"Obsah: 30 ml vzorek","amount":"1.000","priceRatio":"0.0000","weight":"0.083","additionalField":null,"remark":"","itemType":"product","productGuid":"2f551fe6-b195-11eb-be68-0cc47a6b4bcc","amountUnit":"ks","brand":"Anela","itemId":1258804,"itemPrice":{"withVat":"0.00","withoutVat":"0.00","vat":"0.00","vatRate":"21.00"},"unitPrice":{"withVat":"180.00","withoutVat":"148.76","vat":"31.24","vatRate":"21.00"},"displayPrices":[{"withVat":"0.00","withoutVat":"0.00","vat":"0.00","vatRate":"21.00"}],"recyclingFee":null,"purchasePrice":{"withVat":"84.39","withoutVat":"69.74","vat":"14.65","vatRate":"21.00"},"itemPriceVatBreakdown":null,"consumptionTax":null},{"code":null,"name":"DPD (do ruky)","variantName":null,"amount":"1.000","priceRatio":"1.0000","weight":"0.000","additionalField":null,"remark":null,"itemType":"shipping","productGuid":null,"amountUnit":null,"brand":null,"itemId":1258807,"itemPrice":{"withVat":"99.00","withoutVat":"81.82","vat":"17.18","vatRate":"21.00"},"unitPrice":{"withVat":"99.00","withoutVat":"81.82","vat":"17.18","vatRate":"21.00"},"displayPrices":[{"withVat":"99.00","withoutVat":"81.82","vat":"17.18","vatRate":"21.00"}],"recyclingFee":null,"purchasePrice":null,"itemPriceVatBreakdown":null,"consumptionTax":null},{"code":null,"name":"Online bank transfer","variantName":null,"amount":"1.000","priceRatio":"1.0000","weight":"0.000","additionalField":null,"remark":null,"itemType":"billing","productGuid":null,"amountUnit":null,"brand":null,"itemId":1258810,"itemPrice":{"withVat":"59.00","withoutVat":"48.76","vat":"10.24","vatRate":"21.00"},"unitPrice":{"withVat":"59.00","withoutVat":"48.76","vat":"10.24","vatRate":"21.00"},"displayPrices":[{"withVat":"59.00","withoutVat":"48.76","vat":"10.24","vatRate":"21.00"}],"recyclingFee":null,"purchasePrice":null,"itemPriceVatBreakdown":null,"consumptionTax":null}],"billingAddress":{"company":null,"fullName":"REDACTED","street":"REDACTED","houseNumber":null,"city":"REDACTED","district":null,"additional":null,"zip":"REDACTED","countryCode":"CZ","regionName":null,"regionShortcut":null,"companyId":null,"taxId":"","vatId":"","vatIdValidationStatus":null},"deliveryAddress":null,"price":{"vat":"27.42","toPay":"158.00","currencyCode":"CZK","withVat":"158.00","withoutVat":"130.58","exchangeRate":"1.00000000","invoicingExchangeRate":"1.00000000"},"customer":{"guid":"REDACTED","phone":"REDACTED","email":"REDACTED","remark":null},"eshop":{"bankAccount":"REDACTED","iban":"REDACTED","bic":"REDACTED","vatPayer":true},"weight":"0.083","completePackageWeight":"0.083","vatMode":"Normal","proformaInvoiceCodes":[],"proofPayments":[]}},"errors":null,"metadata":{"requestId":"REDACTED"}}
